# Parameter Type Id Array Elements Append To End Property

Source: https://www.revitapidocs.com/2026/f8f7e909-1702-7c56-acc8-c257c9bd8f44.htm

---

| Parameter Type Id Array Elements Append To End Property |
| --- |

"Append To End"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ArrayElementsAppendToEnd { get; }
```

```
Public Shared ReadOnly Property ArrayElementsAppendToEnd As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ArrayElementsAppendToEnd {
	ForgeTypeId^ get ();
}
```

```
static member ArrayElementsAppendToEnd : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace